# CannotMakeRoomsGeometry Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..CannotMakeRoomsGeometry Property
BuiltInFailures..::..RoomFailures Class See Also
---
Could not create geometry for [Room].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMakeRoomsGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMakeRoomsGeometry As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMakeRoomsGeometry {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace